# parameters
nc: 9  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]   # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
    ######### TransformerBlock One #############
    # stream one
    [-1, 1, Focus, [64, 3]],    # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],   # 2-P2/4
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 9, C3, [256]],   # 4-P3/8
    # stream two
    [-4, 1, Focus, [64, 3]],    # 5-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 6-P2/4
    [-1, 3, C3, [128]],   # 7-P2/4
    [-1, 1, Conv, [256, 3, 2]],  # 8-P3/8
    [-1, 9, C3, [256]],   # 9-P3/8

    
    ######### TransformerBlock Two #############
   # transformer fusion
    [[4,9], 1, GPT, [256]],   # 10-P3/8
    [[4,10], 1, Add2, [256,0]],    # 11-P3/8 stream one x+trans[0]
    [[9,10], 1, Add2, [256,1]],    # 12-P3/8 stream two x+trans[1]


   ######### TransformerBlock Three #############
   # stream one
    [11, 1, Conv, [512, 3, 2]],   # 13-P4/16
    [-1, 9, C3, [512]],   # 14-P4/16
   # stream two
    [12, 1, Conv, [512, 3, 2]],   # 15-P4/16
    [-1, 9, C3, [512]],   # 16-P4/16

    ######### TransformerBlock Four #############
    # stream one
    [14, 1, Conv, [1024, 3, 2]],    # 17-P5/32
    [-1, 1, SPP, [1024, [5, 9, 13]]],   # 18-P5/32
    [-1, 3, C3, [1024, False]],   # 19-P5/32
    # stream two
    [16, 1, Conv, [1024, 3, 2]],    # 20-P5/32
    [-1, 1, SPP, [1024, [5, 9, 13]]],   # 21-P5/32
    [-1, 3, C3, [1024, False]],   # 22-P5/32

    ######### Add Block #############
    [[11,12], 1, Add, [1]],   # 23-P3/8 fusion backbone P3
    [[14,16], 1, Add, [1]],   # 24-P4/16 fusion backbone P4
    [[19,22], 1, Add, [1]],   # 25-P5/32 fusion backbone P5

  ]


# YOLOv5 head
head:
  [
    [-1, 1, Conv, [512, 1, 1]],   # 26
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 27
    [[-1,24], 1, Concat, [1]],    # 28 cat backbone P4
    [-1, 3, C3, [512, False]],    # 29

    [-1, 1, Conv, [256, 1, 1]],   # 30
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 31
    [[-1,23], 1, Concat, [1]],    # 32 cat backbone P3
    [-1, 3, C3, [256, False]],    # 33 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],   # 34
    [[-1,30], 1, Concat, [1]],    # 35 cat head P4
    [-1, 3, C3, [512, False]],    # 36 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],    # 37
    [[-1,26], 1, Concat, [1]],     # 38 cat head P5
    [-1, 3, C3, [1024, False]],     # 39 (P5/32-large)

    [[33, 36, 39], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
